[
  {
    "title": " Systems Administrator",
    "company": "UHG",
    "description": "Job Description: Systems Administrator\r\n\r\nWe are currently seeking a skilled Systems Administrator to join our team. As a Systems Administrator, you will be responsible for providing technical support to end users, troubleshooting hardware and software issues, and resolving IT-related problems. Additionally, you will be responsible for installing and configuring computer systems and software, as well as maintaining IT documentation and knowledge base.\r\n\r\nQualifications:\r\n- Bachelor of Business Administration\r\n- Four to fifteen years of demonstrated expertise within the Telecommunications industry\r\n- Specialization in the Telecommunications sector\r\n- Profound understanding of IT Support Specialist\r\n\r\nSkills:\r\n- Technical troubleshooting\r\n- Hardware and software support\r\n- Customer service\r\n- Problem-solving\r\n- Communication\r\n\r\nResponsibilities:\r\n- Provide technical support to end users, addressing hardware and software issues promptly and effectively.\r\n- Troubleshoot and resolve IT-related problems, ensuring minimal disruption to operations.\r\n- Install and configure computer systems and software, ensuring compatibility and optimal performance.\r\n- Maintain IT documentation and knowledge base, keeping it up to date and easily accessible.\r\n- Collaborate with team members to identify and implement improvements to IT systems and processes.\r\n- Stay updated with the latest industry trends and technologies, continuously enhancing your skills and knowledge.\r\n\r\nIf you are a highly skilled Systems Administrator with a strong background in the Telecommunications industry and possess the essential skills mentioned above, we encourage you to apply. Join our team and contribute to the success of our organization.",
    "requirements": [
      "- Bachelor of Business Administration",
      "- Four to fifteen years of demonstrated expertise within the Telecommunications industry",
      "- Specialization in the Telecommunications sector",
      "- Profound understanding of IT Support Specialist"
    ],
    "skills": [
      "Unix",
      "Shell",
      "Perl"
    ],
    "experience_level": "Senior Level",
    "location": "Hyderabad ",
    "salary_range": "50000",
    "user_id": "7455dc33-b10c-4175-b89d-82af82908a57",
    "created_at": "2025-09-03 12:27:53.547940",
    "updated_at": "2025-09-03 12:27:53.547944",
    "_id": "d3974b8c-888f-46de-9c41-d6ae1e3e3b83"
  }
]